// Copyright 2020 Mike Dunston (https://github.com/atanisoft)
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "usb.h"

#if CONFIG_ESPUSB_MSC

// these can be used to fine tune the debug log levels for hex dump of sector
// data within the read callback.
#define MSC_LOG_LEVEL_BOOT_SECTOR ESP_LOG_VERBOSE
#define MSC_LOG_LEVEL_ROOT_DIRECTORY ESP_LOG_VERBOSE
#define MSC_LOG_LEVEL_FAT_TABLE ESP_LOG_VERBOSE
// in order for debug data to be printed this needs to be defined prior to
// inclusion of esp_log.h. The value below is one higher than ESP_LOG_VERBOSE.
//#define LOG_LOCAL_LEVEL ESP_LOG_INFO

#include <endian.h>
#include <esp_idf_version.h>
#include <esp_log.h>
#include <esp_ota_ops.h>
#include <esp_partition.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/timers.h>
#include <vector>
#include "psram_allocator.h"

static constexpr const char * const TAG = "USB:MSC";

typedef enum : uint8_t
{
    PART_EMPTY = 0x00,
    PART_FAT_12 = 0x01,
    PART_FAT_16 = 0x04,
    PART_FAT_16B = 0x06,
    PART_FAT_32_LBA = 0x0C,
    PART_FAT_16B_LBA = 0x0E,
    PART_EXTENDED = 0x0F,
} partition_type_t;

typedef enum : uint8_t
{
    PART_STATUS_UNUSED = 0x00,
    PART_STATUS_ACTIVE = 0x80,
    PART_STATUS_BOOTABLE = 0x80
} partition_status_t;

typedef struct TU_ATTR_PACKED               //  start
{                                           // offset notes
    partition_status_t  status;             //   0x00 status of the disk:
                                            //        0x00 = inactive
                                            //        0x01-0x7f = invalid
                                            //        0x80 = bootable
    uint8_t first_head;                     //   0x01
    uint8_t first_sector;                   //   0x02 this field is split between sector and cylinder:
                                            //        bits 0-5 (0x3F) are for sector
                                            //        bits 6,7 are cylinder bits 8,9
    uint8_t first_cylinder;                 //   0x03
    partition_type_t partition_type;        //   0x04
    uint8_t last_head;                      //   0x05
    uint8_t last_sector;                    //   0x06 this field is split between sector and cylinder:
                                            //        bits 0-5 (0x3F) are for sector
                                            //        bits 6,7 are cylinder bits 8,9
    uint8_t last_cylinder;                  //   0x07
    uint32_t first_lba;                     //   0x08
    uint32_t sector_count;                  //   0x0C
} partition_def_t;

static_assert(sizeof(partition_def_t) == 16,
              "partition_def_t should be 16 bytes");

typedef struct TU_ATTR_PACKED               //  start
{                                           // offset notes
    uint8_t bootstrap[218];                 //  0x000 bootstrap code.
    uint16_t disk_timestamp;                //  0x0DA
    uint8_t original_drive_id;              //  0x0DC
    uint8_t disk_seconds;                   //  0x0DD
    uint8_t disk_minutes;                   //  0x0DE
    uint8_t disk_hours;                     //  0x0DF
    uint8_t boostrap2[216];                 //  0x0E0 bootstrap code part 2
    uint32_t disk_signature;                //  0x1B8
    uint16_t copy_protected;                //  0x1BC
    partition_def_t partitions[4];          //  0x1BE four partition tables
    uint8_t signature[2];                   //  0x1FE signature, 0x55, 0xAA
} master_boot_record_t;

static_assert(sizeof(master_boot_record_t) == 512,
              "master_boot_record_t should be 512 bytes");

typedef struct TU_ATTR_PACKED               //  start
{                                           // offset notes
    uint8_t jump_instruction[3];            //  0x000
    uint8_t oem_info[8];                    //  0x003
    uint16_t sector_size;                   //  0x00B bios param block
    uint8_t sectors_per_cluster;            //  0x00D
    uint16_t reserved_sectors;              //  0x00E
    uint8_t fat_copies;                     //  0x010
    uint16_t root_directory_entries;        //  0x011
    uint16_t sector_count_16;               //  0x013
    uint8_t media_descriptor;               //  0x015
    uint16_t fat_sectors;                   //  0x016
    uint16_t sectors_per_track;             //  0x018 DOS 3.31 BPB
    uint16_t heads;                         //  0x01A
    uint32_t hidden_sectors;                //  0x01C
    uint32_t sector_count_32;               //  0x020
    uint8_t drive_num;                      //  0x024 extended boot param block (FAT 12/16)
    uint8_t reserved;                       //  0x025
    uint8_t boot_sig;                       //  0x026
    uint32_t volume_serial_number;          //  0x027
    char volume_label[11];                  //  0x02B only available if boot_sig = 0x29
    uint8_t fs_identifier[8];               //  0x036 only available if boot_sig = 0x29
    uint8_t boot_code[0x1FE - 0x03E];       //  0x03E
    uint8_t signature[2];                   //  0x1FE signature, 0x55, 0xAA
} bios_boot_sector_t;

static_assert(sizeof(bios_boot_sector_t) == 512,
              "bios_boot_sector_t should be 512 bytes");

typedef enum : uint8_t
{
    DIRENT_READ_ONLY = 0x01,
    DIRENT_HIDDEN = 0x02,
    DIRENT_SYSTEM = 0x04,
    DIRENT_VOLUME_LABEL = 0x08,
    DIRENT_SUB_DIRECTORY = 0x10,
    DIRENT_ARCHIVE = 0x20,
    DIRENT_DEVICE = 0x40,
    DIRENT_RESERVED = 0x80
} dirent_attr_t;

typedef struct TU_ATTR_PACKED               //  start
{                                           // offset notes
    char name[8];                           //   0x00 space padded
    char ext[3];                            //   0x08 space padded
    uint8_t attributes;                     //   0x0B bitmask of dirent_attr_t
    uint8_t reserved;                       //   0x0C
    uint8_t create_time_fine;               //   0x0D
    uint16_t create_time;                   //   0x0E bits 15-11 are hours, 10-5 minutes, 4-0 seconds
    uint16_t create_date;                   //   0x10 bits 15-9 are year (0=1980), 8-5 month, 4-0 day
    uint16_t last_access_date;              //   0x12 same format as create_date
    uint16_t high_start_cluster;            //   0x14 FAT-32 only, high bytes for cluster start
    uint16_t update_time;                   //   0x16 same format as create_time
    uint16_t update_date;                   //   0x18 same format as create_date
    uint16_t start_cluster;                 //   0x1A starting cluster (FAT-16), low order bytes for FAT-32.
    uint32_t size;                          //   0x1C
} fat_direntry_t;

static_assert(sizeof(fat_direntry_t) == 32,
              "fat_direntry_t should be 32 bytes");

typedef struct TU_ATTR_PACKED               //  start
{                                           // offset notes
    uint8_t sequence;                       //   0x00 bit 6 indicates last in sequence, bits 0-5 are index.
    uint16_t name[5];                       //   0x01 first five UTF-16 characters of name
    uint8_t attributes;                     //   0x0B always 0x0F
    uint8_t type;                           //   0x0C always 0x00
    uint8_t checksum;                       //   0x0D
    uint16_t name2[6];                      //   0x0E next six UTF-16 characters of name
    uint16_t start_cluster;                 //   0x1A always 0x0000
    uint16_t name3[2];                      //   0x1C last two UTF-16 charactes of name
} fat_long_filename_t;

static_assert(sizeof(fat_long_filename_t) == sizeof(fat_direntry_t),
              "fat_long_filename_t should be same size as fat_direntry_t");

typedef struct
{
    char name[8];
    char ext[3];
    const char *content;
    uint8_t attributes;
    uint32_t size;
    uint32_t start_sector;
    uint32_t end_sector;
    uint16_t start_cluster;
    uint16_t end_cluster;
    const esp_partition_t *partition;
    std::string printable_name;
    uint8_t root_dir_sector;
#if CONFIG_ESPUSB_MSC_LONG_FILENAMES
    std::vector<fat_long_filename_t,
                PSRAMAllocator<fat_long_filename_t>> lfn_parts;
#endif // CONFIG_ESPUSB_MSC_LONG_FILENAMES
} fat_file_entry_t;

static_assert((CONFIG_ESPUSB_MSC_VDISK_FILE_COUNT & 15) == 0,
              "Number of files on the virtual disk must be a multiple of 16");

static constexpr uint16_t DIRENTRIES_PER_SECTOR =
